---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInSkeletonSketch
source: html/44f079a8-8fc9-d32b-21c2-541768d376db.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInSkeletonSketch Property

Reference Lines can only be constrained to Reference Planes, Levels, Family Host, and other Reference Lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId WrongConstraintInSkeletonSketch { get; }
```